{
  "meta": { "min_sentences": 8, "max_sentences": 13 },

  "roots": {
    "clarification": {
      "title": "Juste pour toi",
      "text": [
        "Merci d’avoir pris ce moment.",
        "Ici, tu n’as rien à prouver : juste te retrouver un peu.",
        "On peut viser une petite clarté, pas une solution parfaite.",
        "Tu peux prendre ce moment comme une pause avant de repartir."
      ]
    },
    "fatigue": {
      "title": "Préserver ton énergie",
      "text": [
        "Merci d’être là, même fatigué(e).",
        "Quand l’énergie baisse, l’objectif n’est pas de “faire plus” : c’est de se préserver.",
        "Tu peux ralentir sans culpabiliser : ce n’est pas un échec.",
        "La fatigue n’est pas un manque de volonté : c’est un signal."
      ]
    },
    "flou": {
      "title": "Reprendre un point de repère",
      "text": [
        "Merci d’avoir pris ce temps.",
        "Le flou n’est pas un défaut : c’est souvent un signal qu’il y a trop de choses à porter.",
        "On peut commencer par un seul repère simple.",
        "Tu n’as pas à tout comprendre aujourd’hui pour avancer un peu."
      ]
    },
    "protection": {
      "title": "Te protéger sans t’isoler",
      "text": [
        "Merci d’avoir pris ce moment.",
        "Prendre du recul peut être une protection saine.",
        "Tu peux avancer doucement, sans te forcer.",
        "Se préserver n’est pas fuir : c’est respecter tes limites."
      ]
    },
    "resilience": {
      "title": "Reconnaître tes efforts",
      "text": [
        "Merci d’avoir pris ce temps.",
        "Ce que tu fais déjà compte, même si personne ne le voit.",
        "La résilience n’est pas bruyante : elle est souvent discrète.",
        "Tenir, c’est déjà une forme de courage."
      ]
    },
    "sortie": {
      "title": "Faire une pause",
      "text": [
        "Merci d’avoir essayé.",
        "Tu as le droit d’arrêter ici : savoir s’arrêter peut être une force.",
        "Si tu veux, on peut juste garder une chose utile et laisser le reste.",
        "Revenir plus tard est aussi une option."
      ]
    }
  },

  "modules": {
    "openings": {
      "stable": [
        "Tu sembles tenir debout aujourd’hui, même si tout n’est pas simple.",
        "Il y a une forme d’équilibre, avec peut-être une fatigue en fond.",
        "Tu avances, et c’est déjà beaucoup.",
        "Tu peux garder ce qui te stabilise et alléger le reste."
      ],
      "neutre": [
        "Tu es dans un entre-deux : ça compte aussi.",
        "Tu n’as pas besoin de tout nommer pour que ce soit réel.",
        "On peut rester simple : regarder sans juger.",
        "Ton ressenti n’a pas besoin d’être spectaculaire pour être valide."
      ],
      "flou": [
        "Il y a du flou, et c’est ok : tu n’as pas à forcer une réponse.",
        "Quand c’est brouillé, le but n’est pas de trancher : c’est de respirer et se situer.",
        "Tu peux te donner le droit de ne pas savoir.",
        "On peut chercher un repère minuscule plutôt qu’une grande explication."
      ],
      "charge": [
        "Tu portes beaucoup en ce moment — le reconnaître change déjà quelque chose.",
        "Quand la charge est là, le corps reste souvent en alerte.",
        "Tu n’es pas “trop” : tu es fatigué(e) d’avoir tenu longtemps.",
        "Ta charge mérite du soutien, pas du jugement."
      ],
      "indetermine": [
        "Tu avances même sans tout définir : c’est déjà juste.",
        "Tu n’as pas besoin d’un diagnostic : juste d’un instant de douceur.",
        "On peut prendre ce moment comme une pause.",
        "Même “difficile à dire” est une information précieuse."
      ]
    },

    "themes": {
      "travail": [
        "Quand le travail prend trop de place, on finit par vivre en mode tension.",
        "Même sans urgence visible, une pression professionnelle peut user au quotidien.",
        "Parfois, ce n’est pas le travail “en soi” : c’est l’empilement et le manque de récupération.",
        "Quand tout doit être performant, le repos devient difficile."
      ],
      "finances": [
        "Quand la sécurité matérielle vacille, le corps reste souvent en alerte.",
        "Les finances créent parfois une tension de fond, très usante.",
        "Ce n’est pas “juste de l’argent” : c’est aussi du sentiment de sécurité.",
        "Le mental calcule en boucle quand il manque de sécurité."
      ],
      "couple": [
        "Une relation qui questionne peut prendre beaucoup de place intérieurement.",
        "Quand le couple est fragile, on se sent parfois seul(e) à deux.",
        "Ce qui n’est pas dit finit souvent par peser.",
        "Le lien affectif touche directement le sentiment de sécurité."
      ],
      "famille": [
        "La famille peut être une ressource… mais aussi une charge quand tout repose sur toi.",
        "Quand ça touche la famille, on le porte souvent jusque dans le corps.",
        "Se sentir responsable de l’équilibre familial peut fatiguer en silence.",
        "Les tensions familiales laissent rarement l’esprit tranquille."
      ],
      "enfants": [
        "Avec les enfants, on se met facilement en dernier : et ça finit par se payer.",
        "La parentalité peut demander beaucoup, même quand on aime fort.",
        "On peut aimer ses enfants et être épuisé(e) — les deux peuvent coexister.",
        "Le manque de relais fatigue autant que les journées elles-mêmes."
      ],
      "amis": [
        "Quand le lien social s’effiloche, on se sent plus exposé(e) à tout.",
        "Se sentir entouré(e) change souvent la façon de porter les choses.",
        "La solitude n’est pas toujours visible, mais elle pèse.",
        "Un seul vrai échange peut déjà faire baisser la tension."
      ],
      "sante": [
        "Quand la santé inquiète, l’esprit reste rarement au repos.",
        "Le corps et l’attention se resserrent vite autour des symptômes et des peurs.",
        "Même une petite inquiétude santé peut occuper beaucoup de place.",
        "Le stress et le corps se répondent : c’est normal de le sentir."
      ],
      "addiction": [
        "Une habitude difficile n’est pas un manque de volonté : c’est un mécanisme de survie devenu lourd.",
        "On peut vouloir arrêter et se sentir coincé(e) : ça ne dit rien de ta valeur.",
        "L’important est de réduire la honte et d’augmenter le soutien.",
        "Plus on se juge, plus le mécanisme se renforce : c’est un piège."
      ],
      "evenement": [
        "Après un événement, le corps peut rester en “après-coup”, même si tout semble normal.",
        "Parfois l’esprit a compris, mais le corps n’a pas encore digéré.",
        "Tu peux te donner le droit d’être encore touché(e).",
        "Ce qui s’est passé peut encore résonner : c’est humain."
      ],
      "multiple": [
        "Quand tout s’additionne, on n’a plus de “place mentale” pour respirer.",
        "Ce qui fatigue le plus, c’est souvent l’empilement, pas un seul problème.",
        "Dans le multiple, l’objectif peut être de trier doucement, pas de tout régler.",
        "Quand c’est multiple, on peut choisir une seule priorité pour aujourd’hui."
      ],
      "rien_de_precis": [
        "Parfois il n’y a pas un “problème”, juste un besoin de se retrouver.",
        "C’est déjà précieux de sentir que quelque chose mérite attention.",
        "Tu peux avancer sans étiquette : juste avec un ressenti.",
        "Le besoin de faire le point est déjà un signal de soin."
      ],
      "preferer_pas": [
        "Tu as le droit de garder une part pour toi.",
        "Le fait de ne pas dire n’annule pas ce que tu ressens.",
        "On peut soutenir sans tout dévoiler.",
        "Tu peux choisir ce que tu partages, et quand."
      ]
    },

    "posture": {
      "effort": [
        "Tu essaies de tenir : ça mérite d’être reconnu, pas minimisé.",
        "Tenir malgré tout consomme de l’énergie : c’est normal que ça coûte."
      ],
      "adaptation": [
        "Faire ce que tu peux avec ce que tu as, c’est déjà beaucoup.",
        "L’adaptation, c’est une forme de force silencieuse."
      ],
      "fatigue": [
        "Se sentir à bout par moments est un signal : ton corps demande une pause.",
        "Tu n’as pas à prouver que tu peux encaisser davantage."
      ],
      "maximum": [
        "Quand tu es “au maximum”, la priorité devient : réduire, pas ajouter.",
        "Dans cet état, le meilleur choix est souvent le plus simple."
      ],
      "confusion": [
        "Quand tu n’y vois pas clair, ton système cherche surtout de la sécurité.",
        "Le flou peut être une réaction au trop-plein, pas un défaut."
      ],
      "melange": [
        "Quand tout se mélange, on peut revenir à une seule question simple : “qu’est-ce qui pèse le plus ?”",
        "Le mélange disparaît rarement d’un coup : il se clarifie par étapes."
      ],
      "protection": [
        "Te préserver est une stratégie saine quand la charge est haute.",
        "Tu as le droit de protéger ton espace mental."
      ],
      "recul": [
        "Prendre du recul peut éviter de t’épuiser davantage.",
        "Recul ne veut pas dire abandon : juste respirer avant d’agir."
      ],
      "stabilite": [
        "Même si “ça va”, tu peux avoir besoin d’un petit ajustement intérieur.",
        "La stabilité peut coexister avec une zone sensible."
      ],
      "point": [
        "Faire le point, c’est déjà reprendre un peu de contrôle.",
        "Tu peux garder une seule chose utile de ce moment."
      ],
      "indetermine": [
        "Ne pas savoir te situer est déjà une indication : tu as besoin de douceur.",
        "On peut rester simple : accueillir sans forcer."
      ]
    },

    "vecu": {
      "melange": [
        "Quand tout se mélange, ton cerveau essaie de tout porter en même temps.",
        "Un tri doux (3 éléments max) peut déjà faire baisser la pression."
      ],
      "porter_seul": [
        "Porter seul(e) fatigue : être reconnu(e) peut déjà alléger un peu.",
        "Tu n’as pas besoin de porter tout ça sans témoin."
      ],
      "fatigue": [
        "La fatigue par accumulation arrive quand les pauses ne suffisent plus.",
        "Ton système te dit peut-être : “ralentis, j’ai besoin d’air”."
      ],
      "tenir_coute": [
        "Gérer en surface, tout en payant le prix à l’intérieur, est très courant.",
        "Reconnaître le coût, c’est déjà te respecter."
      ],
      "mots_difficiles": [
        "Avoir du mal à mettre des mots arrive quand c’est trop chargé émotionnellement.",
        "On peut commencer par un seul mot : “lourd”, “tendu”, “vide”, “peur”…"
      ],
      "rien": [
        "Si rien ne correspond exactement, c’est ok : tu peux rester dans le flou sans te juger.",
        "Parfois, le simple fait de s’arrêter est déjà utile."
      ]
    },

    "needs": {
      "mots": [
        "Tu avais besoin de mettre des mots : choisis une phrase simple qui te ressemble.",
        "Nommer une seule chose vraie suffit : pas besoin d’un roman."
      ],
      "comprendre": [
        "Tu voulais comprendre : vise un petit repère, pas un plan complet.",
        "Comprendre commence souvent par repérer ce qui pèse le plus aujourd’hui."
      ],
      "moins_seul": [
        "Tu avais besoin de te sentir moins seul(e) : ce que tu vis mérite d’être reconnu.",
        "Être reconnu(e) ne règle pas tout, mais ça allège souvent un peu."
      ],
      "normaliser": [
        "Tu voulais vérifier si c’est “normal” : oui, tu n’es pas bizarre, tu es humain.",
        "Ce que tu ressens est plus courant que tu ne le crois — et ça ne dit rien de ta valeur."
      ],
      "recul": [
        "Tu avais besoin de recul : un pas en arrière peut être un vrai soin.",
        "Le recul, ce n’est pas fuir : c’est respirer avant de choisir."
      ],
      "presence": [
        "Tu voulais juste être là : ce moment simple a de la valeur.",
        "Ne rien “faire”, parfois, c’est déjà réparer."
      ],
      "indetermine": [
        "Ne pas savoir exactement est une info en soi : ça mérite de la douceur.",
        "Tu peux rester simple : accueillir sans résoudre."
      ]
    },

    "energy": {
      "faible": [
        "Si ton énergie est basse : réduis l’objectif. Le minimum utile suffit.",
        "Aujourd’hui, la priorité peut être : dormir, manger, respirer. Rien de plus."
      ],
      "parcourir": [
        "Tu peux juste parcourir : pas besoin d’aller loin.",
        "Le but peut être : repérer une seule chose utile et la garder."
      ],
      "reflechir": [
        "Tu peux réfléchir un peu, mais sans te juger.",
        "Chercher du sens est humain : fais-le doucement."
      ],
      "lecture": [
        "Garde ça léger : lire et accueillir suffit.",
        "Tu peux garder ce qui te parle et laisser le reste."
      ],
      "indetermine": [
        "Avance au rythme du jour, sans te forcer.",
        "Tu peux y revenir plus tard : ton rythme compte."
      ]
    },

    "variants": {
      "main": [
        "Si tu ne gardes qu’une chose : une phrase vraie, simple, pour aujourd’hui.",
        "Tu peux t’offrir un petit geste de soin : eau, fenêtre ouverte, épaules relâchées.",
        "Tu peux prendre ce texte comme un miroir doux, pas comme un verdict."
      ],
      "step": [
        "Un pas concret (tout petit) : choisis une action de 2 minutes, pas plus.",
        "Exemple : ranger juste une zone, envoyer un message simple, boire un verre d’eau, ouvrir la fenêtre.",
        "Choisis une action qui te redonne 1% de souffle, pas plus."
      ],
      "calm": [
        "Relâche les épaules. Laisse la mâchoire se desserrer.",
        "Reviens au souffle : inspire doucement, puis expire un peu plus longuement.",
        "Pose les pieds au sol et sens l’appui : ça suffit pour revenir ici."
      ],
      "norm": [
        "Tu n’as pas à être “fort(e)” tout le temps : c’est normal d’atteindre une limite.",
        "Le fait que ça prenne de la place ne veut pas dire que tu échoues : ça veut dire que ça compte.",
        "Beaucoup de gens vivent ça : tu n’es pas seul(e), même si ça y ressemble."
      ]
    },

    "closings": {
      "soft": [
        "Merci d’avoir pris ce moment. Tu peux revenir quand tu veux.",
        "Si c’est trop : reviens à une chose simple. Respire. Bois un peu d’eau. C’est déjà bien.",
        "Tu n’es pas obligé(e) de tout porter seul(e).",
        "Tu peux laisser ce texte reposer et y revenir plus tard."
      ]
    },

    "combos": {
      "famille+travail": [
        "Quand famille et travail se mélangent, on n’a plus vraiment de “pause” : tout devient mental.",
        "Le double rôle (pro + famille) fatigue surtout parce qu’il laisse peu d’espace à toi."
      ],
      "multiple+travail": [
        "Quand il y a “multiple” et travail en même temps, le cerveau reste en mode priorités… sans fin.",
        "Dans ce mélange, le premier soin est souvent : réduire les urgences imaginaires."
      ],
      "multiple+famille": [
        "Quand plusieurs choses s’empilent avec la famille, on peut se sentir responsable de tout.",
        "Dans ce cas, un tri doux est plus utile qu’un effort héroïque."
      ],
      "finances+travail": [
        "Finances + travail crée facilement une boucle : pression → fatigue → moins d’air → encore plus de pression.",
        "Un petit geste de sécurité (plan simple, micro-action) peut déjà calmer le système."
      ],
      "couple+famille": [
        "Quand couple et famille se touchent, ça peut remuer l’attachement, la sécurité, l’identité.",
        "Parfois, ce n’est pas un “problème” : c’est un besoin de se sentir soutenu(e)."
      ],
      "tone:charge+travail": [
        "Charge + travail ressemble souvent à une alerte : ton système demande une baisse de pression.",
        "Dans cet état, faire “plus” n’aide pas : il faut rendre la charge respirable."
      ],
      "tone:charge+famille": [
        "Quand tu es déjà chargé(e), la famille peut devenir “trop”, même si tu aimes : c’est normal.",
        "Ici, l’objectif peut être : récupérer avant de répondre aux demandes."
      ],

      "energie:faible+travail": [
        "Avec énergie basse, le travail devient plus lourd : vise seulement le minimum vital aujourd’hui.",
        "Choisis une seule tâche simple, puis une pause réelle."
      ],
      "energie:faible+famille": [
        "Avec énergie basse, la famille peut demander plus que tu ne peux donner : pose une mini-limite.",
        "Une phrase courte suffit : “Là, j’ai besoin de 10 minutes.”"
      ],

      "posture:fatigue+travail": [
        "Se sentir à bout + travail : ton système est en sur-sollicitation. Le bon geste est souvent “réduire”.",
        "Tu peux choisir de faire moins, mais mieux respirer : c’est plus durable."
      ],
      "posture:fatigue+famille": [
        "À bout + famille, c’est souvent de l’amour sans relais. Tu as le droit de demander du soutien.",
        "Une petite délégation (même 10 minutes) peut déjà changer la journée."
      ],
      "posture:maximum+travail": [
        "Au maximum + travail : ce n’est pas le moment d’optimiser, c’est le moment de sécuriser.",
        "Le vrai progrès ici, c’est de diminuer la pression."
      ],
      "posture:confusion+multiple": [
        "Confusion + multiple : ce n’est pas que tu es perdu(e), c’est que tu es saturé(e).",
        "Un tri en 2 catégories suffit : “urgent” / “pas urgent aujourd’hui”."
      ],
      "posture:protection+couple": [
        "Te préserver + couple : tu sens peut-être que tu as besoin de sécurité avant de parler.",
        "Tu peux choisir un moment calme, ou une phrase courte, plutôt qu’une discussion longue."
      ],
      "posture:recul+famille": [
        "Recul + famille : tu essaies peut-être d’éviter l’épuisement émotionnel.",
        "Tu peux te donner un espace à toi, même petit, sans te justifier."
      ],

      "vecu:porter_seul+famille": [
        "Porter seul(e) + famille : tu as peut-être l’impression d’être “le pilier”. C’est lourd à la longue.",
        "Être témoin de ce que tu vis (une personne sûre) peut déjà soulager."
      ],
      "vecu:melange+travail": [
        "Mélange + travail : quand ça déborde, l’esprit n’arrive plus à fermer les onglets.",
        "Une mini-liste (3 lignes max) peut redonner un repère."
      ],
      "vecu:fatigue+multiple": [
        "Fatigue par accumulation + multiple : ton système demande une baisse globale, pas un effort de plus.",
        "Ici, la bonne stratégie est la simplicité."
      ],

      "besoin:moins_seul+couple": [
        "Besoin de ne pas être seul(e) + couple : tu as peut-être besoin d’être entendu(e) avant de résoudre.",
        "Une phrase simple peut suffire : “J’ai besoin que tu m’écoutes, pas que tu corriges.”"
      ],
      "besoin:recul+travail": [
        "Besoin de recul + travail : ton système demande de l’air avant toute décision.",
        "Une pause courte mais vraie peut réduire la pression."
      ],
      "besoin:normaliser+multiple": [
        "Besoin de normaliser + multiple : oui, c’est normal de saturer quand tout s’empile.",
        "Tu n’es pas “faible” : tu es en surcharge."
      ],
      "besoin:mots+famille": [
        "Besoin de mettre des mots + famille : ce n’est pas forcément un grand discours, juste une phrase vraie.",
        "Exemple : “En ce moment, c’est beaucoup pour moi.”"
      ],

      "posture:fatigue+vecu:tenir_coute": [
        "À bout + “je gère mais ça me coûte” : c’est le signe qu’il faut récupérer, pas serrer les dents.",
        "Reconnaître le coût, c’est déjà commencer à te protéger."
      ],
      "posture:protection+vecu:porter_seul": [
        "Te préserver + porter seul(e) : tu as peut-être manqué de témoin fiable. Ça s’entend.",
        "Tu peux chercher un micro-soutien : un message, une personne, un espace."
      ]
    }
  },

  "closing": [
    "Tu peux revenir demain : ton rythme compte.",
    "Merci d’avoir pris ce temps."
  ]
}