{
  "version": "vivario-scenarios-1.1-test4",
  "meta": {
    "min_sentences": 7,
    "max_sentences": 10,
    "variants": {
      "main": { "min_sentences": 7, "max_sentences": 10 },
      "step": { "min_sentences": 7, "max_sentences": 10 },
      "calm": { "min_sentences": 7, "max_sentences": 10 },
      "norm": { "min_sentences": 7, "max_sentences": 10 }
    }
  },
  "roots": {
    "clarification": {
      "title": "Juste pour toi",
      "intro": [
        "Tu n’as pas besoin de tout résoudre maintenant : clarifier un peu, c’est déjà beaucoup.",
        "Le simple fait d’avoir regardé ça en face mérite du respect.",
        "On peut avancer sans certitudes : un petit éclaircissement suffit pour aujourd’hui."
      ]
    },
    "fatigue": {
      "title": "Préserver ton énergie",
      "intro": [
        "Quand l’énergie est basse, la priorité devient simple : se préserver.",
        "Tu n’as pas à te battre contre toi-même. On peut alléger avant de réparer.",
        "La fatigue mentale rend tout plus dense : ici, on vise la douceur, pas la performance."
      ]
    },
    "flou": {
      "title": "Retrouver un peu de clarté",
      "intro": [
        "Le flou n’est pas un échec : c’est souvent un signe que trop de choses s’empilent.",
        "Quand tout se mélange, on peut revenir à une seule chose à la fois.",
        "Tu peux avancer même si tu ne sais pas encore exactement ce que tu ressens."
      ]
    },
    "protection": {
      "title": "Te protéger sans t’isoler",
      "intro": [
        "Se protéger peut être une sagesse : tu as le droit de ralentir.",
        "Prendre du recul n’est pas fuir : c’est parfois respirer pour tenir.",
        "Tu peux mettre des limites sans te couper de tout."
      ]
    },
    "resilience": {
      "title": "Reconnaître ta force",
      "intro": [
        "Ce que tu fais déjà compte, même si personne ne le voit.",
        "Tenir, s’adapter, continuer… c’est une force réelle, pas une banalité.",
        "Tu avances avec ce que tu as — et ça mérite d’être reconnu."
      ]
    },
    "sortie": {
      "title": "Te respecter",
      "intro": [
        "Si tu veux t’arrêter là, c’est ok. Se respecter est une décision saine.",
        "Tu n’as rien raté : tu as testé. Tu peux choisir autre chose maintenant.",
        "Savoir dire stop est une compétence, pas une faiblesse."
      ]
    }
  },
  "modules": {
    "openings": {
      "stable": [
        "Tu sembles {tone} aujourd’hui — et c’est précieux de le remarquer.",
        "Même quand ça va “globalement”, il peut y avoir un point qui pèse : tu as bien fait de vérifier.",
        "C’est une bonne base : quand on est {tone}, on peut ajuster sans urgence."
      ],
      "neutre": [
        "Tu es {tone} — ni bien ni mal, juste “entre”. C’est une vraie information.",
        "L’entre-deux peut être inconfortable : tu n’as pas besoin de te forcer à trancher.",
        "Tu peux rester là un instant : parfois, c’est exactement ce qu’il faut."
      ],
      "flou": [
        "Tu es {tone}. Ici, on n’essaie pas de forcer la clarté — on la laisse venir.",
        "Le flou arrive souvent quand trop de choses se superposent : tu n’es pas seul(e) là-dedans.",
        "Tu as le droit de ne pas savoir : on peut quand même avancer d’un pas."
      ],
      "charge": [
        "Tu es {tone}. Rien d’étonnant si ton système est en “mode surcharge”.",
        "Quand on est {tone}, le premier soin est de diminuer la pression, pas d’ajouter des exigences.",
        "Tu portes beaucoup. Le reconnaître est déjà un geste de courage."
      ],
      "indetermine": [
        "Difficile à nommer, et pourtant tu es là : c’est déjà une forme de justesse.",
        "Ne pas savoir dire exactement n’empêche pas de sentir : tu peux te traiter avec douceur.",
        "Tu n’as pas besoin d’une étiquette parfaite pour mériter de l’aide."
      ]
    },

    "bridges": [
      "Si tu ne gardes qu’une chose : ce moment t’appartient, sans jugement.",
      "Tu peux lire ça comme une main posée sur ton épaule — pas comme une injonction.",
      "On va rester simple : une idée, puis une autre, sans te submerger."
    ],

    "themes": {
      "travail": [
        "Quand {theme1} prend trop de place, le cerveau reste en alerte — même au repos.",
        "Dans {theme1}, tu peux te sentir “tenu(e)” par des attentes invisibles.",
        "Il y a parfois une fatigue particulière quand {theme1} ne s’arrête jamais vraiment."
      ],
      "finances": [
        "Avec {theme1}, le stress peut devenir continu, comme un fond sonore.",
        "L’insécurité matérielle fatigue : même penser devient plus lourd.",
        "Sur {theme1}, tu n’as pas à porter ça seul(e) — c’est objectivement difficile."
      ],
      "couple": [
        "Dans {theme1}, les émotions peuvent être vives : besoin de sécurité, de reconnaissance, de lien.",
        "Quand {theme1} vacille, on se sent souvent atteint(e) au cœur.",
        "Sur {theme1}, il y a parfois une part de toi qui veut juste être entendue."
      ],
      "famille": [
        "Avec {theme1}, il y a souvent des loyautés, des attentes, des non-dits… ça pèse.",
        "La famille peut être un appui, mais aussi une zone sensible : tu as le droit de le reconnaître.",
        "Sur {theme1}, tu peux porter “trop” par habitude — sans t’en rendre compte."
      ],
      "enfants": [
        "Avec {theme1}, on donne beaucoup — et on s’oublie facilement.",
        "La parentalité peut user : même quand on aime, c’est intense.",
        "Sur {theme1}, ton besoin de souffler est légitime."
      ],
      "amis": [
        "Sur {theme1}, l’isolement peut amplifier tout le reste.",
        "Se sentir seul(e) ou incompris(e) peut faire très mal, même si “objectivement” tout va bien.",
        "Avec {theme1}, un petit lien sûr peut changer beaucoup."
      ],
      "sante": [
        "Sur {theme1}, le corps et l’esprit se répondent : l’inquiétude fatigue vite.",
        "Quand la santé occupe l’esprit, on perd souvent l’espace pour le reste.",
        "Sur {theme1}, tu mérites de la douceur et des repères clairs."
      ],
      "addiction": [
        "Avec {theme1}, il y a souvent de la honte ou du silence — et ça isole.",
        "Une habitude difficile peut être une tentative de tenir : tu n’es pas “faible”.",
        "Sur {theme1}, le plus important est la sécurité et la compréhension, pas la culpabilité."
      ],
      "evenement": [
        "Avec {theme1}, l’intérieur peut rester en mouvement longtemps après.",
        "Un événement peut laisser des vagues : parfois on croit que c’est fini, mais ça travaille encore.",
        "Sur {theme1}, se laisser du temps n’est pas “stagner” — c’est digérer."
      ],
      "multiple": [
        "Quand c’est {theme1}, ce n’est pas “toi” qui es trop : c’est vraiment beaucoup.",
        "Plusieurs choses en même temps, c’est épuisant : tu fais déjà comme tu peux.",
        "Quand tout arrive ensemble, la clarté baisse : c’est normal."
      ],
      "rien_de_precis": [
        "Parfois, on ne peut pas pointer un seul problème : et pourtant, on sent que quelque chose demande de l’attention.",
        "Faire le point sans “raison” est une bonne raison : ton ressenti compte.",
        "Tu as peut-être simplement besoin d’un peu d’espace intérieur."
      ],
      "preferer_pas": [
        "Tu as le droit de garder certaines choses pour toi. Ça n’enlève rien à la réalité de ce que tu ressens.",
        "On peut travailler avec ce que tu choisis de partager, sans te forcer.",
        "Le respect de ton intimité est une force, pas un blocage."
      ]
    },

    "vecu": {
      "melange": [
        "Quand tout se mélange, on peut choisir une seule chose : “qu’est-ce qui pèse le plus aujourd’hui ?”.",
        "Le mélange donne la sensation d’être coincé(e). On peut revenir à une étape : respirer, puis trier.",
        "Si tout se confond, c’est souvent parce que ton cerveau essaie de tout gérer d’un coup."
      ],
      "porter_seul": [
        "Porter seul(e) fatigue double : tu portes le problème et le silence autour.",
        "Même une petite phrase dite à quelqu’un de sûr peut desserrer l’étau.",
        "Garder pour toi peut être une stratégie de survie. Tu peux aussi t’autoriser un peu d’aide."
      ],
      "fatigue": [
        "L’accumulation finit par créer une fatigue qui n’est pas “juste du sommeil”.",
        "La fatigue mentale rend les décisions lourdes. On vise simple : une chose à la fois.",
        "Ton corps te parle peut-être : ralentir est un message, pas un échec."
      ],
      "tenir_coute": [
        "Tenir te coûte — et tu le sais. Le reconnaître, c’est déjà te respecter.",
        "Tu peux tenir ET avoir besoin d’aide : les deux peuvent être vrais.",
        "Quand ça coûte, il faut récupérer. Pas forcément changer tout, juste récupérer un peu."
      ],
      "mots_difficiles": [
        "Si les mots sont difficiles, on peut utiliser des images : “un poids”, “une tension”, “un brouillard”.",
        "Pas besoin d’un vocabulaire parfait : une sensation suffit.",
        "Tu peux commencer par une phrase simple : “en ce moment, c’est lourd”."
      ],
      "rien": [
        "Même si rien ne colle parfaitement, ton ressenti reste valable.",
        "Parfois on ne voit pas encore : ça n’empêche pas de prendre soin.",
        "On peut rester simple et regarder ce qui te fait du bien, même un peu."
      ]
    },

    "posture": {
      "effort": [
        "Le fait que tu essaies de tenir montre une force réelle — mais elle a besoin de relais.",
        "Tenir ne doit pas devenir tout ton quotidien : tu mérites des moments de relâche."
      ],
      "adaptation": [
        "Tu fais avec ce que tu as : c’est souvent plus courageux que ça en a l’air.",
        "S’adapter demande de l’énergie invisible : tu peux aussi demander du soutien."
      ],
      "fatigue": [
        "Se sentir à bout par moments, c’est un signal : pas un défaut.",
        "Quand tu touches tes limites, le bon mouvement peut être de réduire, pas de pousser."
      ],
      "maximum": [
        "Être au maximum n’est pas soutenable longtemps : tu as le droit de ralentir maintenant.",
        "Si tu es au maximum, l’objectif du jour est simple : sécurité + respiration + une action minuscule."
      ],
      "confusion": [
        "Quand c’est confus, on peut choisir un repère : “ce que je veux protéger” ou “ce que je veux alléger”.",
        "Le flou baisse quand on enlève une couche : une seule priorité pour aujourd’hui."
      ],
      "melange": [
        "Le mélange donne l’impression de tourner en rond : on va remettre un peu d’ordre, doucement.",
        "Tu n’as pas besoin d’un plan complet : juste une prochaine étape."
      ],
      "protection": [
        "Te préserver est une bonne stratégie : tu peux mettre des limites sans culpabilité.",
        "Se protéger, c’est aussi choisir à qui tu donnes ton énergie."
      ],
      "recul": [
        "Prendre du recul peut t’aider à respirer. Tu peux y revenir plus tard, mieux armé(e).",
        "Le recul n’est pas abandonner : c’est reprendre de l’air."
      ],
      "stabilite": [
        "Même si globalement ça va, un ajustement peut te faire gagner beaucoup.",
        "Quand c’est stable, c’est le meilleur moment pour consolider tes appuis."
      ],
      "point": [
        "Faire le point est un acte de soin. Tu as bien fait.",
        "Ce moment n’a pas besoin d’être “utile” : il a besoin d’être vrai."
      ],
      "indetermine": [
        "Ne pas savoir où te situer, c’est déjà une info : on reste doux et simple.",
        "Tu peux te laisser le temps d’apparaître à toi-même."
      ]
    },

    "needs": {
      "mots": [
        "Si ton besoin est {need1}, choisis une seule phrase qui te ressemble et garde-la pour toi aujourd’hui.",
        "Mettre des mots ne résout pas tout, mais ça enlève souvent la moitié du poids."
      ],
      "comprendre": [
        "Si ton besoin est {need1}, cherche une petite cause probable, pas “la” vérité parfaite.",
        "Comprendre peut venir par étapes : un indice aujourd’hui vaut mieux qu’une explication totale."
      ],
      "moins_seul": [
        "Si ton besoin est {need1}, pense à une personne “sûre” : une seule interaction peut aider.",
        "Être reconnu(e) apaise : tu mérites ce regard doux."
      ],
      "normaliser": [
        "Si ton besoin est {need1}, rappelle-toi : ton système réagit à ce que tu vis. Ce n’est pas “trop”.",
        "Ce que tu ressens a du sens dans ton contexte. Tu n’es pas cassé(e)."
      ],
      "recul": [
        "Si ton besoin est {need1}, pose une limite simple : 10 minutes sans résoudre, juste respirer.",
        "Le recul ne te ralentit pas : il te protège."
      ],
      "presence": [
        "Si ton besoin est {need1}, alors c’est ok : être là suffit, sans objectif.",
        "Parfois la meilleure action est l’absence d’action : juste revenir au souffle."
      ],
      "indetermine": [
        "Si tu ne sais pas ce qui te ferait du bien, on commence par le plus sûr : respirer et alléger la pression.",
        "Ne pas savoir, c’est une place légitime. On avance doucement."
      ]
    },

    "energy": {
      "lecture": [
        "Avec {energy}, tu peux juste accueillir : tu n’as rien à prouver.",
        "Aujourd’hui, la meilleure stratégie est peut-être la simplicité : lire, respirer, puis stop."
      ],
      "reflechir": [
        "Avec {energy}, tu peux te poser une question utile : “qu’est-ce qui a le plus besoin de soin ?”.",
        "Si tu réfléchis, fais-le sans te juger : une hypothèse suffit."
      ],
      "parcourir": [
        "Avec {energy}, tu peux picorer : une phrase qui aide, puis tu passes.",
        "Pas besoin d’aller au bout : tu prends ce qui te parle, et c’est tout."
      ],
      "faible": [
        "Avec {energy}, on vise micro : un souffle, puis un autre.",
        "Aujourd’hui, ton objectif peut être de diminuer d’1% la tension — c’est déjà énorme."
      ],
      "indetermine": [
        "Avec {energy}, tu peux décider au fil de l’eau : pas de plan rigide.",
        "Tu peux avancer au rythme du jour, sans pression."
      ]
    },

    "normalisation": [
      "Plusieurs émotions à la fois, c’est humain : ton cerveau essaie de protéger ce qui compte.",
      "Quand {theme1} et d’autres choses se mêlent, le flou et la fatigue sont des réactions fréquentes.",
      "Tu n’es pas “trop sensible” : ton système réagit à ce qu’il traverse, et c’est cohérent.",
      "Tu peux avoir l’impression d’être au maximum sans que ça se voie : c’est souvent le cas."
    ],

    "variants": {
      "main": [
        "Si tu devais choisir une intention pour aujourd’hui : te parler comme à quelqu’un que tu aimes.",
        "Tu peux te donner un peu de crédit : tu as traversé {themes} avec les moyens du bord.",
        "Tu n’as pas à aller vite. Tu peux aller vrai."
      ],
      "step": [
        "Un pas concret : choisis une action de 2 minutes (eau, marche, message bref, ranger une petite zone).",
        "Si {theme1} te pèse, écris une seule chose faisable aujourd’hui — pas plus.",
        "Une micro-action réaliste : définir une limite (heure, tâche, personne) pour récupérer un peu."
      ],
      "calm": [
        "Apaisement : relâche les épaules, desserre la mâchoire, puis fais 3 souffles lents.",
        "Pose une main sur la poitrine : “je suis là, je m’accompagne”.",
        "Si ça monte, reviens au corps : pieds au sol, respiration, regard sur un point fixe."
      ],
      "norm": [
        "Normaliser ne minimise pas : ça remet juste ton ressenti à sa place, légitime.",
        "Beaucoup de personnes vivent ça : ce n’est pas une anomalie, c’est une réaction.",
        "Ton cerveau cherche une solution parce qu’il veut te protéger. Ce n’est pas un défaut."
      ]
    },

    "variant_closings": {
      "main": [
        "Tu peux revenir à ce texte quand tu veux — il est là pour toi.",
        "Garde une phrase qui t’aide, et laisse le reste."
      ],
      "step": [
        "Choisis un seul pas. Le deuxième viendra plus tard.",
        "L’objectif n’est pas parfait : l’objectif est faisable."
      ],
      "calm": [
        "Tu peux refaire une minute de souffle maintenant, juste pour calmer le système.",
        "Si tu as besoin, retourne à la respiration guidée : c’est une base sûre."
      ],
      "norm": [
        "Tu as le droit d’être comme tu es aujourd’hui. Point.",
        "Normaliser, c’est enlever la honte. Tu mérites ça."
      ]
    },

    "closings": [
      "Merci d’avoir pris ce temps.",
      "Tu peux t’arrêter ici, ou revenir plus tard : Vivario respecte ton rythme."
    ]
  }
}